app/Helpers/penomoran_helper.php

SELECT COUNT(*) AS `numrows`
FROM `surat`
WHERE `proker_id` = 4
AND `status` = 'Approved'
AND YEAR(updated_at) = '2026'
SELECT *
FROM `program_kerja`
WHERE `program_kerja`.`id` = 4
---
    function generate_nomor_surat(?int $prokerId): string
    {
        if (!$prokerId) {
            return 'SURAT/TPA/BEM-FASILKOM/' . date('Y');
        }

        $suratModel  = new \App\Models\SuratModel();
        $currentYear = date('Y');

        // Hitung berapa surat yang sudah pernah di-Approve untuk proker ini di tahun berjalan
        $approvedCount = $suratModel
            ->where('proker_id', $prokerId)
            ->where('status', 'Approved')
            ->where('YEAR(updated_at)', $currentYear)
            ->countAllResults();

        // Surat pertama selalu diberi nomor istimewa
        if ($approvedCount === 0) {
            return 'ISTIMEWA';
        }

        // Surat ke-2 dst: urutan dimulai dari 001
        $seq = str_pad($approvedCount, 3, '0', STR_PAD_LEFT);

        $prokerModel = new \App\Models\ProgramKerjaModel();
        $proker      = $prokerModel->find($prokerId);