app/Controllers/SekpelController.php

    public function dashboard(): string
    {
        $userId = user_id();
        $suratModel = new SuratModel();

        $suratQuery = $suratModel
            ->select('surat.*, program_kerja.nama as nama_proker, kategori_template.nama_kategori')
            ->join('program_kerja', 'program_kerja.id = surat.proker_id', 'left')
            ->join('kategori_template', 'kategori_template.id = surat.kategori_id', 'left')
            ->where('surat.user_id', $userId)
            ->orderBy('surat.created_at', 'DESC')
            ->findAll();

        $count_draft = 0;
        $count_pending = 0;
        $count_rejected = 0;
        $count_approved = 0;

        foreach ($suratQuery as $s) {
            if ($s['status'] === 'Draft') $count_draft++;
            elseif ($s['status'] === 'Pending') $count_pending++;
            elseif ($s['status'] === 'Rejected') $count_rejected++;
            elseif ($s['status'] === 'Approved') $count_approved++;
        }

        $prokerModel = new ProgramKerjaModel();

        return view('Sekpel/dashboard', [
            'surat_sekpel'  => $suratQuery,
            'count_draft'   => $count_draft,
            'count_pending' => $count_pending,
            'count_rejected'=> $count_rejected,
            'count_approved'=> $count_approved,
            'proker_info'   => $prokerModel->where('user_id', $userId)->first(),
        ]);
---
SELECT `surat`.*, `program_kerja`.`nama` as `nama_proker`, `kategori_template`.`nama_kategori`
FROM `surat`
LEFT JOIN `program_kerja` ON `program_kerja`.`id` = `surat`.`proker_id`
LEFT JOIN `kategori_template` ON `kategori_template`.`id` = `surat`.`kategori_id`
WHERE `surat`.`user_id` = '29'
ORDER BY `surat`.`created_at` DESC
SELECT *
FROM `program_kerja`
WHERE `user_id` = '29'
 LIMIT 1

    public function createSurat()
    {
        // Ambil proker yang dimiliki user yang login (auto, tidak perlu dropdown)
        $prokerAktif = $this->prokerModel->where('user_id', user_id())->first();

        $data = [
            'title'       => 'Buat Surat Baru - Sekpel',
            'prokerAktif' => $prokerAktif, // Proker otomatis dari biodata
            'ketua_bem'   => $this->identityModel->where('jabatan', 'Ketua BEM Fasilkom')->findAll(),
            'dekan'       => $this->identityModel->whereIn('jabatan', ['Dekan Fasilkom', 'Wakil Dekan Bidang Akademik dan Kemahasiswaan', 'Wakil Dekan Bidang Umum dan Keuangan'])->findAll(),
            // Flag: TinyMCE hanya dimuat di halaman ini, bukan secara global
            'useTinyMCE'  => true,
        ];
---
SELECT *
FROM `identity`
WHERE `jabatan` IN ('Dekan Fasilkom','Wakil Dekan Bidang Akademik dan Kemahasiswaan','Wakil Dekan Bidang Umum dan Keuangan')